In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame([{'product_id':23, 'name':'computer', 'wholesale_price': 500, 
                 'retail_price':1000, 'sales':100},
               {'product_id':96, 'name':'Python Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':1000},
               {'product_id':97, 'name':'Pandas Workout', 'wholesale_price': 35,
                'retail_price':75, 'sales':500},
               {'product_id':15, 'name':'banana', 'wholesale_price': 0.5,
                'retail_price':1, 'sales':200},
               {'product_id':87, 'name':'sandwich', 'wholesale_price': 3,
                'retail_price':5, 'sales':300},
               ])

In [4]:
df

   product_id            name  wholesale_price  retail_price  sales
0          23        computer            500.0          1000    100
1          96  Python Workout             35.0            75   1000
2          97  Pandas Workout             35.0            75    500
3          15          banana              0.5             1    200
4          87        sandwich              3.0             5    300

In [5]:
df['current_net'] = (df['retail_price']  - (df['wholesale_price'])) * df['sales']

In [6]:
tax_rates = {
    '15%': 0.15,
    '20%': 0.20,
    '25%': 0.25
}

In [7]:
for key, value in tax_rates.items():
    df['net under: ' + key] = ((df['retail_price'] - df['wholesale_price']) * df['sales'])* (1 - value)
df

,product_id,name,wholesale_price,retail_price,sales,current_net,net under: 15%,net under: 20%,net under: 25%
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0

In [8]:
after_15 = df['net under: 15%'].sum()
after_20 = df['net under: 20%'].sum()
after_25 = df['net under: 25%'].sum()
print(f'{after_15 :.3f}, {after_20 :.3f}, {after_25 :.3f}')

94095.000, 88560.000, 83025.000

In [9]:
df[['current_net', 'net under: 15%', 'net under: 20%','net under: 25%']].sum()

current_net       110700.0
net under: 15%     94095.0
net under: 20%     88560.0
net under: 25%     83025.0
dtype: float64

### Beyond the exercise

An alternative tax plan would charge a 25% tax, but only on products from which you would net more than 20,000. In such a case, how much would you make?

In [10]:
df

,product_id,name,wholesale_price,retail_price,sales,current_net,net under: 15%,net under: 20%,net under: 25%
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0

In [11]:
df['25%_current_net_more_than_20000'] = (df['current_net'][df['current_net'] > 20000] * 0.75)
df

,product_id,name,wholesale_price,retail_price,sales,current_net,net under: 15%,net under: 20%,net under: 25%,25%_current_net_more_than_20000
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0,30000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0,NaN
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0,NaN
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0,NaN

In [12]:
df.fillna(0, inplace=True)
df

,product_id,name,wholesale_price,retail_price,sales,current_net,net under: 15%,net under: 20%,net under: 25%,25%_current_net_more_than_20000
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0,30000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0,0.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0,0.0
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0,0.0

Yet another alternative tax plan would charge a 25% tax on products whose retail price is greater than 80, a 10% tax on products whose retail price is between 30 and 80, and no tax on other products. Implement and calculate the result of such a tax scheme.

In [13]:
pd.cut(df['retail_price'], [0,30,80,df['retail_price'].max()], right=True, labels=[0, 0.10, 0.25]).astype(float)

0    0.25
1    0.10
2    0.10
3    0.00
4    0.00
Name: retail_price, dtype: float64

In [14]:
serie_another_alternative = pd.cut(df['retail_price'], [0,30,80,df['retail_price'].max()], right=True, labels=[1, 0.90, 0.75]).astype(np.float64)

In [15]:
df['point 2 beyond exercise'] = df['current_net'] *  serie_another_alternative
df

,product_id,name,wholesale_price,retail_price,sales,current_net,net under: 15%,net under: 20%,net under: 25%,25%_current_net_more_than_20000,point 2 beyond exercise
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0,37500.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0,30000.0,36000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0,0.0,18000.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0,0.0,100.0
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0,0.0,600.0

### Author's solutions

In [16]:
# Defining a 'real' function with a normla if-else
def calculate_tax(c):
    if c > 20000:
        return c * 0.75
    return c

In [17]:
df['current_net'].apply(calculate_tax)

0    37500.0
1    30000.0
2    20000.0
3      100.0
4      600.0
Name: current_net, dtype: float64

In [18]:
df['current_net'].apply(calculate_tax).sum()

np.float64(88200.0)

In [19]:
df

,product_id,name,wholesale_price,retail_price,sales,current_net,net under: 15%,net under: 20%,net under: 25%,25%_current_net_more_than_20000,point 2 beyond exercise
0,23,computer,500.0,1000,100,50000.0,42500.0,40000.0,37500.0,37500.0,37500.0
1,96,Python Workout,35.0,75,1000,40000.0,34000.0,32000.0,30000.0,30000.0,36000.0
2,97,Pandas Workout,35.0,75,500,20000.0,17000.0,16000.0,15000.0,0.0,18000.0
3,15,banana,0.5,1,200,100.0,85.0,80.0,75.0,0.0,100.0
4,87,sandwich,3.0,5,300,600.0,510.0,480.0,450.0,0.0,600.0

In [20]:
df.loc[4]

product_id                               87
name                               sandwich
wholesale_price                         3.0
retail_price                              5
sales                                   300
current_net                           600.0
net under: 15%                        510.0
net under: 20%                        480.0
net under: 25%                        450.0
25%_current_net_more_than_20000         0.0
point 2 beyond exercise               600.0
Name: 4, dtype: object

In [21]:
df.iloc[4]

product_id                               87
name                               sandwich
wholesale_price                         3.0
retail_price                              5
sales                                   300
current_net                           600.0
net under: 15%                        510.0
net under: 20%                        480.0
net under: 25%                        450.0
25%_current_net_more_than_20000         0.0
point 2 beyond exercise               600.0
Name: 4, dtype: object